import React, { Component } from 'react';
import SupportBtn from '../CommonComponents/SupportBtn/index';
import './style.css';

export default class Privacy extends Component {
  render() {
    // eslint-disable-next-line react/prop-types
    return (
      <div className="main-container">
        <div className="container">
          <SupportBtn
            page_title="ما الخطوات اللازمة لإعداد وتهيئة بيئة العمل ؟"
            title_icon="fas fa-shield-alt"
          />
          <div className="white_container">
            <div className="page_content">
              <p>بعد قيامك بإنشاء حساب جديد و تأكيد البريد الإلكترونى , يتم التوجه إلى <a href="/login" target="_blank">رابط تسجيل الدخول</a> و القيام بتسجيل الدخول إلى حسابك</p>
              <p>&nbsp;</p>
              <p>لديك عدة خطوات لإتمام إعداد الحساب منهم خطوتين أساسيتين هما ( <span style={{ color: "#ff0000" }}>البيانات الشخصية</span> ) و (<span style={{ color: "#ff0000" }}> بيانات المؤسسة</span> )</p> <p>&nbsp;</p> <p>1- الشاشة الترحيبية :</p>
              <p>تظهر لك شاشة ترحب بك فى نظام مدير المشاريع وتوضح لك بعض المعلومات عن النظام .</p>
              <p>&nbsp;</p>
              <p>2- <span style={{ color: "#ff0000" }}>البيانات الشخصية</span> ( خطوة أساسية ) :</p>
              <p>هذه البيانات هى الخاصة بحسابك أنت ومنها اسم الحقيقي و رقم الجوال و الدولة التى تقيم فيها .</p>
              <p>و يجب أن يكون رقم الجوال حقيقياً و مطابقاً للدولة المقيم بها و مكتوباً بالصيغة الدولية , و يستخدم رقم الجوال فى ارسال التنبيهات عبر رسائل SMS</p>
              <p>&nbsp;</p> <p>&nbsp;3-<span style={{ color: "#ff0000" }}> بيانات المؤسسة</span> ( خطوة أساسية ) :</p> <p>هذه البيانات هى الخاصة بمؤسستك و كذلك كلمة مرور الحماية الخاصة بحماية بيانات حسابك ( <a href="/question/3" target="_blank">المزيد من المعلومات عن كلمة مرور الحماية</a> )</p>
              <p>&nbsp;</p>
              <p>4- فروع المؤسسة ( يمكن تجاهلها و إعدادها عند الحاجة ) :</p>
              <p>إذا كانت مؤسستك ذات فروع متعدده يمكنك إضافة هذه الفروع و عنوان كلم منها وذلك لتتمكن فيما بعد من إضافة مدراء لهذه الفروع و تخصيص مشاريع لها . و يمكنك تجاهل هذه الخطوة و الإنتقال إلى الخطوات التالية .</p> <p>و على سبيل المثال يمكن أن يكون اسم الفرع مثلاً : فرع الرياض أو فرع القاهرة أو الفرع الرئيسي .</p>
              <p>&nbsp;</p>
              <p>4- أقسام الفروع ( يمكن تجاهلها و إعدادها عند الحاجة ) :</p>
              <p>إذا قمت بإضافة فروع لمؤسستك فإنه يمكنك فى هذه الخطوة إضافة أقسام و اقسام فرعية لكل من هذه الفروع و من ثم يمكنك فيما بعد إضافة مدراء لهذه الأقسام و تخصيص مشاريع لها . كما يمكنك تجاهل هذه الخطوة و الإنتقال إلى الخطوات التالية .</p>
              <p>و هذه بعض الأمثلة عما يمكن أن يكون اسم القسم : قسم التطوير , القسم المالي , قسم المشاريع الخارجية أو قسم التصميم</p>
              <p>&nbsp;</p>
              <p>4- موظفو المؤسسة ( يمكن تجاهلها و إعدادها عند الحاجة ) :</p>
              <p>يمكنك فى هذه الخطوة إرسال دعوات إلى أشخاص آخرين ترغب فى انضمامهم للنظام و يمكنك توجيه الدعوة وفقاً للرتبة التى ترغب فى إنضمام الموظف عليها كمدير عام أو كمدير فرع أو قسم أو كمدير مشاريع أو موظف عادى .</p> <p>و يسمح بإضافة الموظف بشرط ألا يكون منضماً للنظام من قبل تحت حساب أى من المؤسسات أو الشركات الأخرى التى تدير أعمالها بإستخدام مدير المشاريع .</p>
              <p>و يتم تلقائياً إرسال دعوة إنضمام إلى البريد الإلكترونى الخاص بهذا الموظف . ( <a href="/question/4" target="_blank">كيفية إرسال/إعادة ارسال دعوة إلى بريد الموظف ؟</a> )</p>
              <p>و يجب عليك التنبيه على الأشخاص المضافين أن يتفقدوا بريدهم الإلكتروني بحثاً عن الدعوات الموجة إليهم و الضغط على الرابط الموجود بها و استكمال بيانات إنضمامهم للنظام .</p> <p>&nbsp;</p> <p>5- تفعيل النظام ( الخطوة النهائية ) :</p>
              <p>هذه هى الخطوة النهائية فى عملية إعداد و تهيئة بيئة العمل و بإنهائها سيسمح لك بالدخول إلى النظام للبدأ فى مباشرة أعمالك و كذلك لموظفيك بالدخول للبدأ فى تلقى المهام و العمل عليها .</p>
              <p>إذا حاول أى من موظفيك الذين قبلو الدعوة وقاموا بإستكمال بياناتهم الدخول إلى النظام قبل أن تنهى هذه الخطوة فستظر لهم رسالة مفادها أن مدير النظام مازال يعمل على تهيئته .</p>
              <p>&nbsp;</p>
              <p>&nbsp;</p>
              <p>بذلك إنتهت عملية إعداد و تهيئة بيئة العمل و أصبح حسابك جاهزاً للبدأ فى <a href="/question/9" target="_self">إنشاء المشاريع</a></p>
              <p>&nbsp;</p>
              <p>&nbsp;</p>
            </div>
          </div>
        </div>
      </div>
    );
  }
}
