import React, { Component } from 'react';
import SupportBtn from '../CommonComponents/SupportBtn/index';
import './style.css';

export default class Privacy extends Component {
  render() {
    // eslint-disable-next-line react/prop-types
    return (
      <div className="main-container">
        <div className="container">
          <SupportBtn
            page_title=" كيفية إضافة موظف إلى مشروع أو حذفه ؟"
            title_icon="fas fa-shield-alt"
          />
          <div className="white_container">
            <div className="page_content">
              <p>يوفر نظام مدير المشاريع خصوصية تامة للمشاريع التى يتم العمل عليها و ذلك بإستخدام صلاحيات الوصول , فربما هناك مشروع ما تريد أن يقوم به و يطلع عليه بعض الموظفين دون غيرهم .</p>
              <p>&nbsp;</p>
              <p>
                <span style={{ color: "#800000" }}>خطوات إعطاء موظف ما الصلاحية للدخول على مشروع ما :</span>
              </p>
              <p>1- يجب أولاً أن يكون الموظف الذى ترغب فى إضافته إلى المشروع مضافاً فى النظام <a href="/question/4" target="_blank">عن طريق الدعوات</a> و قام بقبول الدعوة و التحق بالنظام .</p>
              <p>2- يتم الدخول إلى المشروع المطلوب إضافة الموظف إليه و من ثم الدخول إلى تبويب الموظفين و الضغط على زر إدراج موظف و اختيار الموظف ووضع المسمى الوظيفى له , و يكون المسمى الوظيفى معبراً عن الوظفيه التى يشغلها الموظف داخل المشروع و الدور الذى يقوم به .</p>
              <p>&nbsp;</p>
              <p>إذا لم يكن هناك موظفين غير مضافين ستظهر لك رسالة أنه لا يوجد موظفين غير مدرجين بالمشروع و يقترح عليك رابط إضافة موظف جديد عبر نظام الدعوات و كذلك إذا لم يكن لديك أى موظفين ( قبلوا الدعوات ) فى النظام .</p>
              <p>&nbsp;</p>
              <p><span style={{ color: "#800000" }}>حذف الموظف من مشروع ما :</span></p>
              <p>يمكنك كذلك حظر موظف ما من الدخول إلى مشروع معين عن طريق حذف الصلاحيات التى أعطيت لها لدخول ذلك المشروع عن طريق زر الحذف الموجود فى نفس التبويب أمام الموظف المعنى</p>
              <p>و حظر الموظف لا يحذف نشاطه السابق فى المشروع من تعليقات أو خلافه ولكنه يمنعه من القيام بأى أنشطه جديده فى هذا المشروع أو الإطلاع عليه</p>
              <p>&nbsp;</p>
              <p>صورة التبويب الخاص بالموظفين :</p>
              <p><img src="http://pmngr.com/assets/uploads/system/uploads/upload-1417470260.png" alt="" width="750" height="338" /></p>
              <p>&nbsp;</p>
            </div>
          </div>
        </div>
      </div>
    );
  }
}