import React, { Component } from 'react';
import SupportBtn from '../CommonComponents/SupportBtn/index';
import './style.css';

export default class Privacy extends Component {
  render() {
    // eslint-disable-next-line react/prop-types
    return (
      <div className="main-container">
        <div className="container">
          <SupportBtn
            page_title="ماهى كلمة مرور الحماية وما فائدتها وكيفية استرجاعها أو تغييرها ؟"
            title_icon="fas fa-shield-alt"
          />
          <div className="white_container">
            <div className="page_content">
              <p>كلمة مرور الحماية هى كلمة مرور لا يعرفها إلا من أنشأ النظام و الحساب الرئيسي للشركة أو المؤسسة و الغرض منها هو تحقيق الحماية القصوي للنظام وحماية بيانات المؤسسة و مشاريعها من الحذف و التعديل .</p>
              <p>&nbsp;</p>
              <p>فكما يحدث مع أغلبنا قد نترك جهاز الحاسب مفتوحاً بالخطأ و قد يصل إليه أحد العابثين بأى وسيلة . و هنا يأتى دور كلمة مرور الحماية للحماية من العبث فى مشاريع المؤسسة , أقسامها , فروعها و موظفيها .</p>
              <p>&nbsp;</p>
              <p>تحتم كلمة مرور الحماية على من يريد تعديل أو حذف أى من هذه البيانات أن يكون على معرفة بهذه الكلمة و إلا فإن النظام لن يسمح له بذلك .</p>
              <p>&nbsp;</p>
              <p>لتحقيق الفائدة الكاملة من هذه الطريقة لم نجعل إسترجاعها أو تغييرها متاحاً بطريقة سهلة أو مباشرة و ذلك منعاً للعبث بها , و يتحتم على من يريد أن يسترجعها أو يغيرها أن يقوم <a href="/new_ticket" target="_self">بمراسلة الدعم الفنى</a> لنظام مدير المشاريع و بعد عملية التحقق من شخصيته سوف يتم تغييرها .</p>
              <p>&nbsp;</p>
              <p>نصائح حول كلمة مرور الحماية :</p>
              <p>حاول على قدر الإمكان أن تجعل كلمة المرور صعبة التخمين و فى نفس الوقت سهلة التذكر لكى لا تكون مضطراً إلى عملية استرجاعها التى تتطلب التدخل من قبل فريق الدعم الفنى .</p>
              <p>&nbsp;</p>
            </div>
          </div>
        </div>
      </div>
    );
  }
}
