import React, { Component } from 'react';
import SupportBtn from '../CommonComponents/SupportBtn/index';
import './style.css';

export default class Privacy extends Component {
  render() {
    // eslint-disable-next-line react/prop-types
    return (
      <div className="main-container">
        <div className="container">
          <SupportBtn
            page_title=" الخصائص والمميزات "
            title_icon="fas fa-trophy"
          />
          <div className="white_container">
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                قابلية الاستخدام
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                : يتميز نظام إدارة المشاريع بمرونته وصلاحيته للإستخدام على أكثر
                من شكل فهو صالح للإستخدام من قبل{' '}
                <ul>
                  {' '}
                  <li>
                    الشركات الكبيرة ذات الفروع المتعدده و الأقسام و الموظفين
                  </li>{' '}
                  <li>
                    الشركات الصغيرة والمتوسطة ذات الفرع الواحد و الموظفين
                    المحدودين
                  </li>{' '}
                  <li>مجموعات العمل كطلاب مشاريع التخرج أو المطورين</li>{' '}
                  <li>الأفراد الراغبين فى تنظيم أعمالهم والتعامل مع العملاء</li>{' '}
                </ul>{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                التعامل عن بعد
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                . يوفر نظام مدير المشاريع مكاناً يلتقى فيه الجميع للتعامل
                والإنجاز والنقاش بشكل عملى سهل مع توفر الأدوات اللازمة لذلك{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                كل شئ محفوظ ومرتب
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                مشروعاتك , مهامك ,ملحوظاتك ,نقاشاتك و كل شئ آخر دار فى النظام
                سيبقى موجوداً ومتاحاً لك و لأفراد مؤسستك مما يسهل عليك الرجوع
                إليه فى أى وقت{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                صُمم للجميع
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                حرصنا أثناء انشاء النظام أن يكون متوافقاً مع الشاشات المختلفة
                الكبيرة والصغيرة , الهواتف المحمولة و الأجهزة اللوحية و الحاسوب{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                الجوانب المادية
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                الكثير من أنظمة إدارة المشاريع لا تهتم بالجوانب المادية وتترك
                هذا الجانب لأنظمة إدارة الموارد و لكننا حرصنا عند تطوير نظام
                مدير المشاريع أن نخالف تلك القاعدة لتسهيل إدارة المشروع بشكل
                متكامل وقمنا بتوفيرها في خاصيتين{' '}
                <ul>
                  {' '}
                  <li>
                    ميزانية المشروع : و هى خاصية للمشروع تسمح بإضافة بنود
                    ميزانية المشروع كافة و التكلفة التقريبية لكل بند و يقوم
                    النظام بجمعها و إظهار الميزانية الكلية المرصودة للمشروع
                  </li>{' '}
                  <li>
                    مصروفات المهام : حيث يحدد من يقوم بإنشاء المهمة القيمة
                    القصوى المرصوده لميزانية هذه المهمة و يتم فى أثناء العمل على
                    المهمة إضافة بنود المصاريف بحيث لا تتعداها
                  </li>{' '}
                </ul>{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                الأولويات و نسبة الإنجاز
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                يمكنك مدير المشاريع من تحديد أولوية المهام و تتميز المهمة بلون
                معين وفقاً لدرجة أهميتها , مما يساعدك على توجيه موظفيك ولفت
                إنتباههم إلى الأكثر أهمية <br /> كذلك حرصنا على أن تظهر نسبة
                إنجاز المهمة دائماً أمام أعين الموظف ليعرف دائماً أن لديه المزيد
                من العمل{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                التخطيط و الوقت
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                : أضفنا إلى المهام خاصيتين فى غاية الأهمية تساعد الموظف على
                التخطيط الجيد لعمله ووقته و هما{' '}
                <ul>
                  {' '}
                  <li>
                    أوقات العمل : و فيها يضغط الموظف قبل البدأ فى العمل على
                    المهمة على زر تشغيل يقوم ببدأ تشغيل عداد لإحتساب الوقت الذى
                    يعمل عليه , و بعد الإنتهاء من العمل يقوم بضغط زر إيقاف
                    العداد لتظهر له نافذة تطالبه بوضع ما قام به من إنجاز فى تلك
                    الفترة التى عملها. و تلك الخاصية تساعد المدراء كذلك فى
                    متابعة موظفيهم ومعرفة كم الوقت المستغرق منهم لآداء مهام
                    معينة فيكون مقياساً على مدى كفاءة الموظف
                  </li>{' '}
                  <li>
                    خطوات التنفيذ : تساعد خطوات التنفيذ تقسيم المهمة على شكل
                    خطوات بحيث يتم شطب كل خطوة بعد الإنتهاء منها مما يسهل العمل
                    على المهمة ومعرفة ما تم إنجازه
                  </li>{' '}
                </ul>{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                التواصل و الخصوصية
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                يوفر تطبيق قنوات التواصل فى نظام مدير المشاريع إمكانية إضافة أى
                عدد من قنوات التواصل إلى أى من المشاريع التى ينتمى إليها الموظف{' '}
                <br /> . حيث يقوم الموظف بتحديد الموظفين الآخرين المرغوب
                إنضمامهم لقناة التواصل بحيث لا يمكن لأحد غيرهم الدخول لها أو
                معرفة مادار فيها <br />. كذلك طورت قنوات التواصل لجعل التواصل
                مباشراً و ليس كنظام الرسائل الخاصة{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                الإحصائيات و السجلات
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                يوفر مدير المشاريع خاصية الإحصائيات لمعرفة إحصائيات عن موظف معين
                أو مشروع معين أو فرع أو قسم معين كما يمكن حصر التقرير على فترة
                زمنية محددة{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                البحث الدقيق
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                يمكنك البحث فى نطاق زمنى محدد و فى مشروع محدد وفى أماكن محدده
                كالتعليقات أو المهام و يتم إظهار نتائج البحث بشكل مرتب يوضح أين
                تم إيجاد كلمات البحث بالضبط{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                التنبيهات
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                : نظام التنبيهات فى مدير المشاريع ينقسم إلى ثلاثة أنواع{' '}
                <ul>
                  {' '}
                  <li>
                    نظام التنبيهات الداخلى : و هو يعمل بشكل تلقائى حيث تظهر
                    التنبيهات وحدها بدون الحاجه لإعادة تنشيط الصفحة
                  </li>{' '}
                  <li>
                    تنبيهات البريد الإلكترونى : و تكون إختيارية و يمكن إستخدامها
                    عند إسناد مهام لموظف أو وضع تعليق على مهمة و كذلك عند الرد
                    على تذاكر الدعم الفنى
                  </li>{' '}
                  <li>
                    تكون إختيارية و يمكن إستخدامها إذا ماكان هناك رصيد لديك فى
                    النظام المشترك به : SMS تنبيه
                  </li>{' '}
                </ul>{' '}
              </div>{' '}
            </div>
            <div className="single_feature">
              {' '}
              <h4 className="nice_font">
                تطبيقات مساعدة
                <i className="fa fa-star" />
              </h4>{' '}
              <div className="single_feature_text">
                {' '}
                : قمنا فى مدير المشاريع بتطوير بعض التطبيقات الأخرى غير قنوات
                التواصل مثل{' '}
                <ul>
                  {' '}
                  <li>
                    المفكرة : تساعدة لحفظ أى أفكار أو خواطر أو بيانات لسهولة
                    الوصول لها فيما بعد مع تحديد الهام منها بعلامة مميزة
                  </li>{' '}
                  <li>
                    الأخبار : يعطيك تطبيق الأخبار ميزة رائعه فى إيصال الأخبار
                    إلى موظفيك بشكل سهل حيث تظهر الأخبار فى أعلى الصفحة الرئيسية
                    للموظف
                  </li>{' '}
                  <li>
                    الفعاليات : يمكنك من خلالها تحديد مواعيد إقامة و أماكن
                    الفعاليات التى تنوى إقامتها كالمناسبات و الإجتماعات و
                    الإجازات و غيرها
                  </li>{' '}
                </ul>{' '}
              </div>{' '}
            </div>
          </div>
        </div>
      </div>
    );
  }
}
